Page({

  /**
   * 页面的初始数据
   */
  data: {
    xieyiValue: "一、****科技有限公司概述  （注：协议请您仔细阅读特别是红色部分，如有不理解地方请参阅官网客服页面，或与客服联系：****）  本协议是注册会员与****科技有限公司及其关联企业之间的法律协议。  “关联企业”系指现在或将来与****科技有限公司构成“一方控制、共同控制另一方或对另一方施加重大影响，以及两方或两方以上同受一方控制、共同控制或重大影响”的关系的企业，下面文直称为“****”。    “注册会员”是指愿意接受或实际上已经接受****提供的产品和服务的个人。    此份协议是注册会员接受****产品和服务时适用的通用条款。因此，请您在注册成为****会员的注册会员前或接受****的产品和服务之前，请您详细地阅读本注册会员协议的所有内容。    注册会员了解并同意：只要注册会员点击“同意”按钮并完成注册，注册会员就已接受了本注册会员协议及****公布的各项服务规则（包括填写实名的联系方式等等），并愿意受其约束。如果发生纠纷，注册会员不得以未仔细阅读为由进行抗辩。    注册会员了解并同意：随着市场经营情况的变化，****有权随时更改本注册会员协议及相关服务规则。修改本注册会员协议时，****将于相关页面公告修改的事实，有权不对注册会员进行个别通知。注册会员应该在每次登录购买商品前查询****官方网站的相关公告，以了解本注册会员协议及其他服务规则的变化。若注册会员不同意本注册会员协议或相关服务规则，或者不同意****作出的修改，注册会员可以主动停止使用****提供的产品和服务，如果在****修改协议或服务规则后，注册会员仍继续使用****提供的产品和服务，即表示注册会员同意****对本注册会员协议及相关服务规则所做的所有修改。由于注册会员在注册会员协议变更后因未熟悉公告规定而引起的损失，****将不会承担任何责任。   ****（以下简称本站）的各项电子服务的所有权和运作权归本站。本站提供的服务将完全按照其发布的服务条款和操作规则严格执行。注册会员必须完全同意所有服务条款并完成注册程序，才能成为本站的注册会员。注册会员确认：本协议条款是处理双方权利义务的当然约定依据，除非违反国家强制性法律，否则始终有效。在下订单的同时，您也同时承认了您拥有购买这些产品的权利能力和行为能力，并且将您对您在订单中提供的所有信息的真实性负责。 二、服务简介  本站运用自己的",
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
    
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
    
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
    
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
    
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
    
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
    
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
    
  }
})